In [1]:
import pandas as pd

In [2]:
Saleries = pd.read_csv(r'C:\Users\lien0\OneDrive\Documents\Data Science Salaries _cleaned 2021.csv')
Saleries.head()

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na

In [3]:
Saleries.drop(['Salary Estimate', 'Job Description', 'Headquarters', 'Size', 'Founded', 'Revenue', 'Competitors', 'Hourly', 'Employer provided', 'company_txt', 'Age', 'job_title_sim', 'seniority_by_title'], axis= 1, inplace= True)

In [4]:
Saleries.head()

,index,Job Title,Rating,Company Name,Location,Type of ownership,Industry,Sector,Lower Salary,Upper Salary,...,pytorch,scikit,tensor,hadoop,tableau,bi,flink,mongo,google_an,Degree
0,0,Data Scientist,3.8,Tecolote Research\n3.8,"Albuquerque, NM",Company - Private,Aerospace & Defense,Aerospace & Defense,53,91,...,0,0,0,0,1,1,0,0,0,M
1,1,Healthcare Data Scientist,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD",Other Organization,Health Care Services & Hospitals,Health Care,63,112,...,0,0,0,0,0,0,0,0,0,M
2,2,Data Scientist,4.8,KnowBe4\n4.8,"Clearwater, FL",Company - Private,Security Services,Business Services,80,90,...,0,0,0,0,0,0,0,0,0,M
3,3,Data Scientist,3.8,PNNL\n3.8,"Richland, WA",Government,Energy,"Oil, Gas, Energy & Utilities",56,97,...,0,0,0,0,0,0,0,0,0,na
4,4,Data Scientist,2.9,Affinity Solutions\n2.9,"New York, NY",Company - Private,Advertising & Marketing,Business Services,86,143,...,0,0,0,0,0,0,0,0,0,na

In [5]:
Saleries['Company Name'].value_counts()

MassMutual\n3.6                                         14
Reynolds American\n3.1                                  14
Takeda Pharmaceuticals\n3.7                             14
Software Engineering Institute\n2.6                     11
PNNL\n3.8                                               10
                                                        ..
Dayton Freight Lines, Inc.\n4.3                          1
Community Action Partnership of San Luis Obispo\n2.8     1
TrueAccord\n3.4                                          1
DRB Systems\n4.0                                         1
Fivestars\n3.9                                           1
Name: Company Name, Length: 343, dtype: int64

In [6]:
Saleries['Sector'].value_counts()

Information Technology                180
Biotech & Pharmaceuticals             112
Business Services                      97
Insurance                              69
Health Care                            49
Finance                                42
Manufacturing                          34
Aerospace & Defense                    25
Education                              23
Retail                                 15
Oil, Gas, Energy & Utilities           14
Government                             11
-1                                     10
Non-Profit                              9
Transportation & Logistics              8
Real Estate                             8
Travel & Tourism                        8
Telecommunications                      6
Media                                   6
Arts, Entertainment & Recreation        4
Consumer Services                       4
Mining & Metals                         3
Construction, Repair & Maintenance      3
Agriculture & Forestry                  1
Accounting & Legal                      1
Name: Sector, dtype: int64

In [7]:
Saleries["Type of ownership"].value_counts()

Company - Private                 410
Company - Public                  193
Nonprofit Organization             55
Subsidiary or Business Segment     34
Government                         15
Hospital                           15
College / University               13
Other Organization                  5
School / School District            2
Name: Type of ownership, dtype: int64

In [8]:
Saleries[['City', 'State']] = Saleries['Location'].str.split(',', 1, expand=True)

In [9]:
Saleries.head()

,index,Job Title,Rating,Company Name,Location,Type of ownership,Industry,Sector,Lower Salary,Upper Salary,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,Degree,City,State
0,0,Data Scientist,3.8,Tecolote Research\n3.8,"Albuquerque, NM",Company - Private,Aerospace & Defense,Aerospace & Defense,53,91,...,0,0,1,1,0,0,0,M,Albuquerque,NM
1,1,Healthcare Data Scientist,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD",Other Organization,Health Care Services & Hospitals,Health Care,63,112,...,0,0,0,0,0,0,0,M,Linthicum,MD
2,2,Data Scientist,4.8,KnowBe4\n4.8,"Clearwater, FL",Company - Private,Security Services,Business Services,80,90,...,0,0,0,0,0,0,0,M,Clearwater,FL
3,3,Data Scientist,3.8,PNNL\n3.8,"Richland, WA",Government,Energy,"Oil, Gas, Energy & Utilities",56,97,...,0,0,0,0,0,0,0,na,Richland,WA
4,4,Data Scientist,2.9,Affinity Solutions\n2.9,"New York, NY",Company - Private,Advertising & Marketing,Business Services,86,143,...,0,0,0,0,0,0,0,na,New York,NY

In [14]:
state_count = Saleries["State"].value_counts().loc[lambda y : y>9]
state_count

 CA    151
 MA    103
 NY     72
 VA     41
 IL     40
 MD     35
 PA     33
 TX     28
 WA     21
 NC     21
 NJ     17
 FL     16
 OH     14
 TN     13
 DC     11
 CO     11
 WI     10
 IN     10
 UT     10
Name: State, dtype: int64

In [15]:
Saleries.join(pd.)

,index,Job Title,Rating,Company Name,Location,Type of ownership,Industry,Sector,Lower Salary,Upper Salary,...,hadoop,tableau,bi,flink,mongo,google_an,Degree,City,State,State_count
0,0,Data Scientist,3.8,Tecolote Research\n3.8,"Albuquerque, NM",Company - Private,Aerospace & Defense,Aerospace & Defense,53,91,...,0,1,1,0,0,0,M,Albuquerque,NM,NaN
1,1,Healthcare Data Scientist,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD",Other Organization,Health Care Services & Hospitals,Health Care,63,112,...,0,0,0,0,0,0,M,Linthicum,MD,NaN
2,2,Data Scientist,4.8,KnowBe4\n4.8,"Clearwater, FL",Company - Private,Security Services,Business Services,80,90,...,0,0,0,0,0,0,M,Clearwater,FL,NaN
3,3,Data Scientist,3.8,PNNL\n3.8,"Richland, WA",Government,Energy,"Oil, Gas, Energy & Utilities",56,97,...,0,0,0,0,0,0,na,Richland,WA,NaN
4,4,Data Scientist,2.9,Affinity Solutions\n2.9,"New York, NY",Company - Private,Advertising & Marketing,Business Services,86,143,...,0,0,0,0,0,0,na,New York,NY,NaN

In [16]:
Saleries.drop('State_count', axis=1)
Saleries.head()

,index,Job Title,Rating,Company Name,Location,Type of ownership,Industry,Sector,Lower Salary,Upper Salary,...,hadoop,tableau,bi,flink,mongo,google_an,Degree,City,State,State_count
0,0,Data Scientist,3.8,Tecolote Research\n3.8,"Albuquerque, NM",Company - Private,Aerospace & Defense,Aerospace & Defense,53,91,...,0,1,1,0,0,0,M,Albuquerque,NM,NaN
1,1,Healthcare Data Scientist,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD",Other Organization,Health Care Services & Hospitals,Health Care,63,112,...,0,0,0,0,0,0,M,Linthicum,MD,NaN
2,2,Data Scientist,4.8,KnowBe4\n4.8,"Clearwater, FL",Company - Private,Security Services,Business Services,80,90,...,0,0,0,0,0,0,M,Clearwater,FL,NaN
3,3,Data Scientist,3.8,PNNL\n3.8,"Richland, WA",Government,Energy,"Oil, Gas, Energy & Utilities",56,97,...,0,0,0,0,0,0,na,Richland,WA,NaN
4,4,Data Scientist,2.9,Affinity Solutions\n2.9,"New York, NY",Company - Private,Advertising & Marketing,Business Services,86,143,...,0,0,0,0,0,0,na,New York,NY,NaN

In [17]:
del Saleries['State_count']
Saleries.head()

,index,Job Title,Rating,Company Name,Location,Type of ownership,Industry,Sector,Lower Salary,Upper Salary,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,Degree,City,State
0,0,Data Scientist,3.8,Tecolote Research\n3.8,"Albuquerque, NM",Company - Private,Aerospace & Defense,Aerospace & Defense,53,91,...,0,0,1,1,0,0,0,M,Albuquerque,NM
1,1,Healthcare Data Scientist,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD",Other Organization,Health Care Services & Hospitals,Health Care,63,112,...,0,0,0,0,0,0,0,M,Linthicum,MD
2,2,Data Scientist,4.8,KnowBe4\n4.8,"Clearwater, FL",Company - Private,Security Services,Business Services,80,90,...,0,0,0,0,0,0,0,M,Clearwater,FL
3,3,Data Scientist,3.8,PNNL\n3.8,"Richland, WA",Government,Energy,"Oil, Gas, Energy & Utilities",56,97,...,0,0,0,0,0,0,0,na,Richland,WA
4,4,Data Scientist,2.9,Affinity Solutions\n2.9,"New York, NY",Company - Private,Advertising & Marketing,Business Services,86,143,...,0,0,0,0,0,0,0,na,New York,NY